/////////////////////////////////////////////////////////////////////////////////////////////
//文件名：		CSearchPlan.cpp
//功  能：		实现基于搜索的规划类。包括前向搜索、逆向搜索等
//开发者：		高志强
//日  期：		2022年10月07日
//更  新：		2022年10月12日
//长  度：		30行
/////////////////////////////////////////////////////////////////////////////////////////////
#include "stdafx.h"									//MFC标准头文件
#include "CSearchPlan.h"							//基于搜索的规划类头文件


//名  称：		CSearchPlan()
//功  能：		构造函数
//参  数：		无
//返回值：		无
CSearchPlan::CSearchPlan()
{
}

//名  称：		~CSearchPlan()
//功  能：		析构函数
//参  数：		无
//返回值：		无
CSearchPlan::~CSearchPlan()
{
}